In [5]:
import pandas as pd
import numpy as np

In [6]:
df=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split (),columns = 'W X Y Z '. split())

In [7]:
df

          W         X         Y         Z
A  0.390327  0.029081  1.755265 -0.035417
B -2.104142 -0.165492 -1.605654  0.097875
C  0.167808 -0.765042 -0.141485  0.243740
D  2.139760  2.481488 -0.107085  1.718653
E  0.153128  0.356385 -1.795352  0.954493

In [8]:
df['W']

A    3.521624
B   -0.737612
C   -1.655988
D    1.830794
E    0.018804
Name: W, dtype: float64

In [9]:
df.W

A    3.521624
B   -0.737612
C   -1.655988
D    1.830794
E    0.018804
Name: W, dtype: float64

In [13]:
df[['W','Z','X']]

          W         Z         X
A  3.521624  0.099460  0.670931
B -0.737612 -0.255476 -1.306623
C -1.655988 -1.705932 -0.042204
D  1.830794 -2.079203  0.505453
E  0.018804 -0.588686 -0.060715

In [14]:
df['baru']=df['W']+df['Y']

In [15]:
df

          W         X         Y         Z      baru
A  3.521624  0.670931 -0.411109  0.099460  3.110515
B -0.737612 -1.306623  0.046147 -0.255476 -0.691465
C -1.655988 -0.042204 -0.384310 -1.705932 -2.040297
D  1.830794  0.505453 -1.171821 -2.079203  0.658973
E  0.018804 -0.060715 -1.047952 -0.588686 -1.029148

In [17]:
df.drop ('baru',axis=1)

          W         X         Y         Z
A  3.521624  0.670931 -0.411109  0.099460
B -0.737612 -1.306623  0.046147 -0.255476
C -1.655988 -0.042204 -0.384310 -1.705932
D  1.830794  0.505453 -1.171821 -2.079203
E  0.018804 -0.060715 -1.047952 -0.588686

In [18]:
df

          W         X         Y         Z      baru
A  3.521624  0.670931 -0.411109  0.099460  3.110515
B -0.737612 -1.306623  0.046147 -0.255476 -0.691465
C -1.655988 -0.042204 -0.384310 -1.705932 -2.040297
D  1.830794  0.505453 -1.171821 -2.079203  0.658973
E  0.018804 -0.060715 -1.047952 -0.588686 -1.029148

In [19]:
df.drop ('baru',axis=1,inplace=True)

In [20]:
df

          W         X         Y         Z
A  3.521624  0.670931 -0.411109  0.099460
B -0.737612 -1.306623  0.046147 -0.255476
C -1.655988 -0.042204 -0.384310 -1.705932
D  1.830794  0.505453 -1.171821 -2.079203
E  0.018804 -0.060715 -1.047952 -0.588686

In [21]:
df.drop('E',axis=0)

          W         X         Y         Z
A  3.521624  0.670931 -0.411109  0.099460
B -0.737612 -1.306623  0.046147 -0.255476
C -1.655988 -0.042204 -0.384310 -1.705932
D  1.830794  0.505453 -1.171821 -2.079203

In [24]:
df.loc['A']

W    3.521624
X    0.670931
Y   -0.411109
Z    0.099460
Name: A, dtype: float64

In [25]:
df.iloc[2]

W   -1.655988
X   -0.042204
Y   -0.384310
Z   -1.705932
Name: C, dtype: float64

In [26]:
df.loc['C','Z']

-1.7059324319852938

In [27]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  3.521624 -0.411109
B -0.737612  0.046147

In [28]:
df>0

       W      X      Y      Z
A   True   True  False   True
B  False  False   True  False
C  False  False  False  False
D   True   True  False  False
E   True  False  False  False

In [29]:
df[df>0]

          W         X         Y        Z
A  3.521624  0.670931       NaN  0.09946
B       NaN       NaN  0.046147      NaN
C       NaN       NaN       NaN      NaN
D  1.830794  0.505453       NaN      NaN
E  0.018804       NaN       NaN      NaN

In [30]:
df[df['W']>0]

          W         X         Y         Z
A  3.521624  0.670931 -0.411109  0.099460
D  1.830794  0.505453 -1.171821 -2.079203
E  0.018804 -0.060715 -1.047952 -0.588686

In [31]:
df[df['W']>0]['Y']

A   -0.411109
D   -1.171821
E   -1.047952
Name: Y, dtype: float64

In [32]:
df[df['W']>0][['Y','Z']]

          Y         Z
A -0.411109  0.099460
D -1.171821 -2.079203
E -1.047952 -0.588686

In [38]:
df[ (df['W']>0) | (df['X']>1)]

          W         X         Y         Z
A  3.521624  0.670931 -0.411109  0.099460
D  1.830794  0.505453 -1.171821 -2.079203
E  0.018804 -0.060715 -1.047952 -0.588686

In [8]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.390327  0.029081  1.755265 -0.035417
1     B -2.104142 -0.165492 -1.605654  0.097875
2     C  0.167808 -0.765042 -0.141485  0.243740
3     D  2.139760  2.481488 -0.107085  1.718653
4     E  0.153128  0.356385 -1.795352  0.954493

In [9]:
df['kode'] = 'INA IND JPN RSA USA'.split ()

In [10]:
df

          W         X         Y         Z kode
A  0.390327  0.029081  1.755265 -0.035417  INA
B -2.104142 -0.165492 -1.605654  0.097875  IND
C  0.167808 -0.765042 -0.141485  0.243740  JPN
D  2.139760  2.481488 -0.107085  1.718653  RSA
E  0.153128  0.356385 -1.795352  0.954493  USA

In [11]:
df.set_index('kode')

             W         X         Y         Z
kode
INA   0.390327  0.029081  1.755265 -0.035417
IND  -2.104142 -0.165492 -1.605654  0.097875
JPN   0.167808 -0.765042 -0.141485  0.243740
RSA   2.139760  2.481488 -0.107085  1.718653
USA   0.153128  0.356385 -1.795352  0.954493

In [12]:
df

          W         X         Y         Z kode
A  0.390327  0.029081  1.755265 -0.035417  INA
B -2.104142 -0.165492 -1.605654  0.097875  IND
C  0.167808 -0.765042 -0.141485  0.243740  JPN
D  2.139760  2.481488 -0.107085  1.718653  RSA
E  0.153128  0.356385 -1.795352  0.954493  USA

In [13]:
df.set_index('kode',inplace=True)

In [14]:
df

             W         X         Y         Z
kode
INA   0.390327  0.029081  1.755265 -0.035417
IND  -2.104142 -0.165492 -1.605654  0.097875
JPN   0.167808 -0.765042 -0.141485  0.243740
RSA   2.139760  2.481488 -0.107085  1.718653
USA   0.153128  0.356385 -1.795352  0.954493

In [17]:
dataLabels=['G1','G1','G1','G2','G2','G2']
dataValue = [1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue))

data =pd.MultiIndex.from_tuples(data)

In [18]:
zip(dataLabels,dataValue)

In [19]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [20]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [21]:
df=pd.DataFrame(np.random.randn(6,2),index=data,columns=['A','B'])

In [22]:
df

             A         B
G1 1  0.546919  0.073934
   2 -1.703406  0.542763
   3  0.666663 -0.182213
G2 1  0.008193 -0.179421
   2  0.028990  0.349841
   3  0.354957 -0.436005

In [23]:
df.loc['G1']

          A         B
1  0.546919  0.073934
2 -1.703406  0.542763
3  0.666663 -0.182213

In [24]:
df.loc['G1'].loc[3]

A    0.666663
B   -0.182213
Name: 3, dtype: float64

In [25]:
df.index.names

FrozenList([None, None])

In [26]:
df.index.names = ['Group','No']

In [27]:
df

                 A         B
Group No
G1    1   0.546919  0.073934
      2  -1.703406  0.542763
      3   0.666663 -0.182213
G2    1   0.008193 -0.179421
      2   0.028990  0.349841
      3   0.354957 -0.436005

In [28]:
df.xs('G1')

           A         B
No
1   0.546919  0.073934
2  -1.703406  0.542763
3   0.666663 -0.182213

In [30]:
df.xs(['G2',2])

A    0.028990
B    0.349841
Name: (G2, 2), dtype: float64

In [31]:
df.xs(1,level='No')

              A         B
Group
G1     0.546919  0.073934
G2     0.008193 -0.179421